anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32FxQI/K1986VE1xI.svd
                <register>
                    <name>DATAH</name>
                    <description>CAN Transmit Data high Register</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DB4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DB5</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DB6</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DB7</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUF_CON00</name>
                    <description>CAN Buffer Connection Register</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RX_TXn</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVER_EN</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTR_EN</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRIOR_0</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_REQ</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RX_FULL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVER_WR</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON01</name>
                    <addressOffset>0x00000044</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON02</name>
                    <addressOffset>0x00000048</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON03</name>
                    <addressOffset>0x0000004C</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON04</name>
                    <addressOffset>0x00000050</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON05</name>
                    <addressOffset>0x00000054</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON06</name>
                    <addressOffset>0x00000058</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON07</name>
                    <addressOffset>0x0000005C</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON08</name>
                    <addressOffset>0x00000060</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON09</name>
                    <addressOffset>0x00000064</addressOffset>
                </register>
