anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32FxQI/K1986VE1xI.svd
                <register derivedFrom="CH1_CNTRL2">
                    <name>CH2_CNTRL2</name>
                    <addressOffset>0x00000064</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL2">
                    <name>CH3_CNTRL2</name>
                    <addressOffset>0x00000068</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL2">
                    <name>CH4_CNTRL2</name>
                    <addressOffset>0x0000006C</addressOffset>
                </register>
                <register>
                    <name>CCR11</name>
                    <description>Timer Capture/Compare1 Register</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CCR11">
                    <name>CCR21</name>
                    <addressOffset>0x00000074</addressOffset>
                </register>
                <register derivedFrom="CCR11">
                    <name>CCR31</name>
                    <addressOffset>0x00000078</addressOffset>
                </register>
                <register derivedFrom="CCR11">
                    <name>CCR41</name>
                    <addressOffset>0x0000007C</addressOffset>
                </register>
                <register>
                    <name>DMA_RE1</name>
                    <addressOffset>0x00000080</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>DMA_RE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="DMA_RE1">
                    <name>DMA_RE2</name>
                    <addressOffset>0x00000084</addressOffset>
                </register>
                <register derivedFrom="DMA_RE1">
                    <name>DMA_RE3</name>
                    <addressOffset>0x00000088</addressOffset>
                </register>
                <register derivedFrom="DMA_RE1">
                    <name>DMA_RE4</name>
                    <addressOffset>0x0000008C</addressOffset>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="MDR_TIMER1">
            <name>MDR_TIMER2</name>
            <description>TIMER2</description>
            <groupName>TIMER</groupName>
            <baseAddress>0x40078000</baseAddress>
            <interrupt>
                <name>Timer2_IRQ</name>
                <value>15</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="MDR_TIMER1">
            <name>MDR_TIMER3</name>
            <description>TIMER3</description>
            <groupName>TIMER</groupName>
            <baseAddress>0x40080000</baseAddress>
            <interrupt>
                <name>Timer3_IRQ</name>
                <value>16</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="MDR_TIMER1">
            <name>MDR_TIMER4</name>
            <description>TIMER4</description>
            <groupName>TIMER</groupName>
            <baseAddress>0x40098000</baseAddress>
            <interrupt>
                <name>Timer4_IRQ</name>
                <value>13</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>MDR_ADC</name>
            <version>1.0</version>
            <description>ADC</description>
            <groupName>ADC</groupName>
            <baseAddress>0x40088000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x1000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ADC_IRQ</name>
                <value>17</value>
            </interrupt>
            <registers>
                <register>
                    <name>ADC1_CFG</name>
                    <description>ADC1 Configuration Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Cfg_REG_ADON</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Cfg_REG_GO</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Cfg_REG_CLKS</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Cfg_REG_SAMPLE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Cfg_REG_CHS</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Cfg_REG_CHCH</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Cfg_REG_RNGC</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Cfg_M_REF</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Cfg_REG_DIVCLK</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Cfg_Sync_Conver</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TS_EN</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TS_BUF_EN</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_TS</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_VREF</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TR</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Delay_Go</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Delay_ADC</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC2_CFG</name>
                    <description>ADC2 Configuration Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00020000</resetMask>
                    <fields>
                        <field>
                            <name>ADC1_OP</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_H_LEVEL</name>
                    <description>ADC1 High Level Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000FFF</resetMask>
                    <fields>
                        <field>
                            <name>REG_H_LEVEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_L_LEVEL</name>
                    <description>ADC1 Low Level Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000FFF</resetMask>
                    <fields>
                        <field>
                            <name>REG_L_LEVEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_RESULT</name>
                    <description>ADC1 Result Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0FFF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHANNEL</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_STATUS</name>
                    <description>ADC1 Status Register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001F</resetMask>
                    <fields>
                        <field>
                            <name>Flg_REG_OVERWRITE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Flg_REG_AWOIFEN</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Flg_REG_EOCIF</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWOIF_IE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECOIF_IE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_CHSEL</name>
                    <description>ADC1 Channel Selector Register</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Sl_Ch_Ch_REF</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_TRIM</name>
                    <description>ADC1 TRIM</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000007E</resetMask>
                    <fields>
                        <field>
                            <name>TS_TRIM</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_REF_BUF</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
